/*
  jflp.c - Jason's Freelancer Patch code support.

  Jason Hood, 31 May, 2009.

  This patch removes the following warnings from FLSpew:
  * couldnt find material 163618903
	Generated when a waypoint is selected.  I was unable to fix it, so just
	remove the warning, instead.
  * get_zone(N) failed
	Generated when a job sector has no name, which is quite frequently.
  * Disconnecting equipment with FATE_UNKNOWN, using FATE_DISAPPEAR
	Generated when a wreck drops its weapons.  This is a bug in Freelancer.exe,
	since it doesn't detect the "fate_loot" type.
  * Used Hostile Pick Assistance
	Not sure exactly when this is generated (or even why), but it's something
	to do with targetting enemy fighters.

  2 June, 2009:
  + replace the line number of the "Deform::start_aim" notice with the
	timestamp of the event (in milliseconds; it also replaces the string with
	"(null)", in order to fit the new code).

  26 & 27 August, 2009:
  + add proper stat displays for Powerplants, Engines, Scanners, Tractor Beams
	and Armor.	Not used by the vanilla game, but most mods display them.
	Also add a blank line after "Stats".

  7 to 9 September, 2009:
  + provide widescreen support.

  v1.01, 22 September, 2009:
  + allow roll to work during mouse flight.

  v1.10, 2 & 3 October, 2009:
  - fixed widescreen support;
  * use En Dash instead of Hyphen-Minus for the trade lane arrow;
  + added 8-way strafing;
  + put the sector letter first (as in "Sector C4");

  + allow viewing of server info, even for different versions.

  v1.21, 25 July, 2012:
  - fixed ADDR_FONT4a (added 1 to the already-added address);
  + removed the "ArchDB::Get" random mission spew warning;
  * use a specific base address.

  v1.22, 22 June, 2018:
  - retrieve the base address of "dacom.dll" & "thorn.dll".

  v1.23, 11 October, 2019:
  - fixed ratio of widescreen cinematics.

  v1.24, 31 August, 2020:
  - fixed widescreen text clipping in the Contact List.

  v1.25, 2 September, 2020:
  - fixed widescreen crosshair size.

  Build (VC 6):
	rc jflp.rc
	cl /nologo /W3 /O2 /GF /MD /LD jflp.c jflp.res /link /base:0x6100000 /filealign:512
*/
typedef unsigned int uint;

#define WIN32_LEAN_AND_MEAN
#include <windows.h>
#include <stdio.h>
#include <math.h>

#pragma comment(lib, "user32.lib")

#define PI 3.14159265358979

#define NAKED __declspec(naked)
#define STDCALL __stdcall

DWORD dummy;
#define ProtectX(addr, size) \
	VirtualProtect(addr, size, PAGE_EXECUTE_READWRITE, &dummy)
#define ProtectW(addr, size) \
	VirtualProtect(addr, size, PAGE_READWRITE, &dummy)

#define RELOFS(from, to) \
	*(PDWORD)(from) = (DWORD)(to) - (DWORD)(from)-4

#define REL2ABS(addr) ((DWORD)(addr) + *(PDWORD)(addr) + 4)

#define NEWOFS(from, to)      \
	to##_Old = REL2ABS(from); \
	RELOFS(from, to##_Hook)

#define INDIRECT(from, to)                 \
	(DWORD) to##_Old = **(PDWORD *)(from); \
	to##_New = (DWORD)to##_Hook;           \
	*(PDWORD *)(from) = &to##_New

// Stats ---------------------------------------------------------------------

void Stats_Hook(void);

const DWORD stats_jump_table[] = {
	(DWORD)Stats_Hook, // Power
	(DWORD)Stats_Hook, // Engine
	(DWORD)Stats_Hook, // Scanner
	(DWORD)Stats_Hook, // Tractor
	(DWORD)Stats_Hook, // Armor
	(DWORD)Stats_Hook, // ShieldGenerator
	0x484DA9,		   // Thruster
	0x484377,		   // Gun 0x484377
	0x4840E3,		   // MineDropper 0x484A6B
	(DWORD)Stats_Hook, // CounterMeasureDropper
	0x484C9C,		   // RepairKit
	0x484D23,		   // ShieldBattery
	0x484A6B,		   // Munition & Mine
	0x4851E5,		   // CounterMeasure
	0x485495,		   // default
};

const BYTE stats_jump_index[] = {
	0,	// Power
	1,	// Engine
	14, // Shield
	5,	// ShieldGenerator
	6,	// Thruster
	14, // Launcher
	7,	// Gun
	8,	// MineDropper
	9,	// CounterMeasureDropper
	2,	// Scanner
	14, // Light
	3,	// Tractor
	14, // AttachedFXEquip
	14, // InternalFXEquip
	14, // RepairDroid
	10, // RepairKit
	11, // ShieldBattery
	14, // CloakingDevice
	14, // TradeLaneEquip
	14, // Projectile
	12, // Munition
	12, // Mine
	13, // CounterMeasure
	4	// Armor
};

const BYTE stats_BOOL_index[] = {
	0, // Power
	0, // Engine
	1, // Shield
	0, // ShieldGenerator
	0, // Thruster
	1, // Launcher
	0, // Gun
	0, // MineDropper
	0, // CounterMeasureDropper
	0, // Scanner
	1, // Light
	0, // Tractor
	1, // AttachedFXEquip
	1, // InternalFXEquip
	1, // RepairDroid
	0, // RepairKit
	0, // ShieldBattery
	1, // CloakingDevice
	1, // TradeLaneEquip
	1, // Projectile
	0, // Munition
	0, // Mine
	0, // CounterMeasure
	0  // Armor
};

struct Vector
{
	float x;
	float y;
	float z;
};

struct Root
{
	/*  1 */ uint vtable;
	/*  2 */ uint iArchId;
	/*  3 */ char *szName;
	/*  4 */ uint iArchType;
	/*  5 */ uint iIdsName;
	/*  6 */ uint iIdsInfo;
	/*  7 */ float fHitPoints;
	/*  8 */ float fMass;
	/*  9 */ int iExplosionArchId;
	/* 10 */ float fExplosionResistance;
	/* 11x4 */ union
	{
		float fRotationInertia[3];
		struct Vector vRotationInertia;
	};
	/* 14 */ BOOL bHasRotationInertia;
	BOOL bPhantomPhysics;
	/* 15 */ uint iDunno1;
	/* 16 */ uint iDunno2;
	/* 17 */ void *anim;
	/* 18 */ uint iArray[5]; // not sure about this.
};

struct Equipment
{
	BYTE padding[sizeof(struct Root)];
	/* 23 */ float fVolume;
	/* 24 */ uint bUseCount;
	/* 25 */ uint iUnitsPerContainer;
	/* 26 */ uint iTractoredExplosionId;
	/* 27 */ uint bLootable;
};

struct EqObj
{
	BYTE padding[sizeof(struct Root)];
	/* 23 */ void *cg;
	/* 24 */ uint iDunno1;
	/* 25 */ uint iDunno2;
	/* 26 */ uint iDunno3;
	/* 27 */ uint iDunno4;
	/* 28 */ uint iDunno5;
	/* 29 */ uint iDunno6;
	/* 30 */ uint iDunno7;
	/* 31 */ uint iDunno9;
	/* 32 */ BOOL b128;
	BOOL bDockingCamera;
	/* 33 */ uint iDunno10;
	/* 34 */ uint iDunno11;
	/* 35 */ uint iDunno12;
};

struct AttachedEquipment
{
	BYTE padding[sizeof(struct Equipment)];
	/* 28 */ uint iSeparationExplosionId;
	/* 29 */ uint iDebrisTypeId;
	/* 30 */ float fChildImpulse;
	/* 31 */ float fParentImpulse;
	/* 32 */ char *szHpChild;
	/* 33 */ int iToughness;
};

struct Armor
{
	BYTE padding[sizeof(struct Equipment)];
	/* 28 */ float fHitPointsScale;
};

struct CloakingDevice
{
	BYTE padding[sizeof(struct AttachedEquipment)];
	/* 34 */ float fPowerUsage;
	/* 35 */ float fCloakinTime;
	/* 36 */ float fCloakoutTime;
	/* 37 */ uint iCloakinFxId;
	/* 38 */ uint iCloakoutFxId;
};

struct Engine
{
	BYTE padding[sizeof(struct Equipment)];
	/* 28 */ float fMaxForce;
	/* 29 */ float fLinearDrag;
	/* 30 */ float fPowerUsage;
	/* 31 */ float fCruisePowerUsage;
	/* 32 */ float fCruiseChargeTime;
	/* 33 */ BOOL bIndestructible;
	/* 34 */ float fReverseFraction;
};

struct Explosion
{
	/*  0 */ uint iID;
	/*  1 */ float fRadius;
	/*  2 */ float fImpulse;
	/*  3 */ float fHullDamage;
	/*  4 */ float fEnergyDamage;
	// and some other stuff
};

struct Launcher
{
	BYTE padding[sizeof(struct AttachedEquipment)];
	/* 34 */ float fDamagePerFire;
	/* 35 */ float fPowerUsage;
	/* 36 */ float fRefireDelay;
	/* 37 */ float fMuzzleVelocity;
	/* 38 */ uint iProjectileArchId;
	/* 39 */ char *szUseAnimation;
};

struct Gun
{
	BYTE padding[sizeof(struct Launcher)];
	/* 40 */ float fDispersionAngle;
	/* 41 */ float fTurnRate;
	/* 42 */ float fGunAzimuth[2];
	/* 44 */ float fGunElevation[2];
	/* 46 */ BOOL bUseGunAzimuth;
	BOOL bUseGunElevation;
	BOOL bAutoTurret;
	/* 47 */ uint stdVectorHpTypes[4]; // st6::vector?
};

struct MineDropper
{
	BYTE padding[sizeof(struct Launcher)];
	// no fields here
};

struct Power
{
	BYTE padding[sizeof(struct Equipment)];
	/* 28 */ float fCapacity;
	/* 29 */ float fChargeRate;
	/* 30 */ float fThrustCapacity;
	/* 31 */ float fThrustChargeRate;
};

struct Projectile
{
	BYTE padding[sizeof(struct Equipment)];
	/* 28 */ float fLifeTime;
	/* 29 */ float fOwnerSafeTime;
	/* 30 */ BOOL bRequiresAmmo;
	BOOL bForceGunOri;
	/* 31 */ uint iLootAppearanceId;
};

struct CounterMeasure
{
	BYTE padding[sizeof(struct Projectile)];
	/* 32 */ float fLinearDrag;
	/* 33 */ float fRange;
	/* 34 */ float fDiversionPctg;
};

struct CounterMeasureDropper
{
	BYTE padding[sizeof(struct Launcher)];
	/* 40 */ float fAiRange;
};

struct Munition
{
	BYTE padding[sizeof(struct Projectile)];
	/* 32 */ float fHullDamage;
	/* 33 */ float fEnergyDamage;
	/* 34 */ uint iWeaponTypeId;
	/* 35 */ uint iMotorId;
	/* 36 */ uint iSeeker; // 2 = lock, dumb = 1, ? = 0
	/* 37 */ float fTimeToLock;
	/* 38 */ float fSeekerRange;
	/* 39 */ float fSeekerFovDeg;
	/* 40 */ float fMaxAngularVelocity;
	/* 41 */ float fDetonationDist;
	/* 42 */ uint iHpType;
	/* 43 */ BOOL bCruiseDisruptor;
};

struct Mine
{
	BYTE padding[sizeof(struct Projectile)];
	/* 32 */ float fLinearDrag;
	/* 33 */ float fDetonationDist;
	/* 34 */ float fSeekerDist;
	/* 35 */ float fAcceleration;
	/* 36 */ float fTopSpeed;
};

struct Scanner
{
	BYTE padding[sizeof(struct Equipment)];

	/* 28 */ float fPowerUsage;
	/* 29 */ float fRange;
	/* 30 */ float fCargoScanRange;
};

struct ShieldGenerator
{
	BYTE padding[sizeof(struct AttachedEquipment)];
	/* 34 */ uint iHpType;
	/* 35 */ uint iShieldTypeId;
	/* 36 */ float fRegenerationRate;
	/* 37 */ float fMaxCapacity;
	/* 38 */ float fConstantPowerDraw;
	/* 39 */ float fRebuildPowerDraw;
	/* 40 */ float fOfflineThreshold;
	float fOfflineRebuildTime;
	/* 41 */ uint stdVectorHpShieldType[3];
};

struct Thruster
{
	BYTE padding[sizeof(struct AttachedEquipment)];
	/* 34 */ float fPowerUsage;
	/* 35 */ float fMaxForce;
};

struct Tractor
{
	BYTE padding[sizeof(struct Equipment)];
	/* 28 */ float fMaxLength;
	/* 29 */ float fReachSpeed;
};

HMODULE multicruise = INVALID_HANDLE_VALUE;
LPVOID cruise_map, cruise_map_end;
float *cruising_speed;
DWORD find_eng;

void Find_MultiCruise()
{
	if (multicruise == INVALID_HANDLE_VALUE)
	{
		multicruise = GetModuleHandle("MultiCruise.dll");
		if (multicruise != NULL)
		{
			if (*(PDWORD)((PBYTE)multicruise + 0x1534) == (DWORD)multicruise + 0xCD0C)
			{
				cruise_map = (PBYTE)multicruise + 0xCD0C;
				cruise_map_end = (PBYTE)multicruise + 0xCD10;
				cruising_speed = (float *)((PBYTE)multicruise + 0xCD04);
				find_eng = (DWORD)multicruise + 0x14A0;
			}
			else
			{
				multicruise = NULL;
			}
		}
	}
}

float Cruise_Speed(UINT eng)
{
	LPVOID end;

	if (!multicruise)
		return 0;

	__asm {
	lea	edx, eng
	lea	eax, end
	push	edx
	push	eax
	mov	ecx, cruise_map
	call	find_eng
	mov	eax, end
	mov	ecx, cruise_map_end
	mov	edx, cruising_speed
	cmp	eax, [ecx]
	je	done
	lea	edx, [eax+0x10]
  done:
	fld	dword ptr [edx]
	}
}

